In [3]:
import mysql.connector as connection


mydb = connection.connect(host = "localhost",database = 'mydatabase',user = "root",passwd = "Vishal@9850",use_pure = True )

    #check if the connection is established

query = 'insert into customer(name, address) values ("Vishal","Ahmednagar"),("Radhika","Pachegoan"),("Dipak","Rahuri"),("Raj","Nashik") '
cursor = mydb.cursor()
cursor.execute(query)
print(cursor.fetchall())

print(cursor.rowcount,"Records inserted.")

[]
4 Records inserted.

In [4]:
mydb.commit()

In [7]:
query = " insert into customer(name, address) values ('Peter', 'Lowstreet 4'), ('Amy', 'Apple st 652'), ('Hannah', 'Mountain 21'),('Michael', 'Valley 345'), ('Sandy', 'Ocean blvd 2'), ('Betty', 'Green Grass 1'), ('Richard', 'Sky st 331'), ('Susan', 'One way 98'), ('Vicky', 'Yellow Garden 2') "

cur1 = mydb.cursor()
cur1.execute(query)

print(cur1.fetchall())

print(cur1.rowcount, " records inserted")

[]
9  records inserted

In [9]:
mydb.commit()
cur2 = mydb.cursor()
cur2.execute(" insert into customer(name, address) values ('Ro','Nashik-02') ")
print(cur2.fetchall())
print("last record inserted has id : ",cur2.lastrowid)

[]
last record inserted has id :  15

In [11]:
mydb = connection.connect(host = "localhost",database = 'mydatabase',user = "root",passwd = "Vishal@9850",use_pure = True )
mycur = mydb.cursor()

To check the inserted data, we use select command in sql

In [12]:
import pandas as pd

In [14]:
a = pd.read_sql("select * from customer",mydb)
a

    id     name          address
0    1   Vishal       Ahmednagar
1    2  Radhika        Pachegoan
2    3    Dipak           Rahuri
3    4      Raj           Nashik
4    5    Peter      Lowstreet 4
5    6      Amy     Apple st 652
6    7   Hannah      Mountain 21
7    8  Michael       Valley 345
8    9    Sandy     Ocean blvd 2
9   10    Betty    Green Grass 1
10  11  Richard       Sky st 331
11  12    Susan       One way 98
12  13    Vicky  Yellow Garden 2
13  14       Ro        Nashik-02

In [18]:
mycur.execute("select * from customer")
res = mycur.fetchall()

for i in res :
    print(i)

(1, 'Vishal', 'Ahmednagar')
(2, 'Radhika', 'Pachegoan')
(3, 'Dipak', 'Rahuri')
(4, 'Raj', 'Nashik')
(5, 'Peter', 'Lowstreet 4')
(6, 'Amy', 'Apple st 652')
(7, 'Hannah', 'Mountain 21')
(8, 'Michael', 'Valley 345')
(9, 'Sandy', 'Ocean blvd 2')
(10, 'Betty', 'Green Grass 1')
(11, 'Richard', 'Sky st 331')
(12, 'Susan', 'One way 98')
(13, 'Vicky', 'Yellow Garden 2')
(14, 'Ro', 'Nashik-02')

To fetch only 1 observation at a time, we use fetchone option.

In [20]:
mydb.commit()
a = mydb.cursor()
a.execute("select * from customer")
result = a.fetchone()
print(result)

(1, 'Vishal', 'Ahmednagar')